; domain
;;Created by Tomas de la Rosa
;;Domain for painting floor tiles with two colors

(define (domain floor-tile)
(:requirements :typing)
(:types robot tile color - object)

(:predicates 	
		(robot-at ?r - robot ?x - tile)
		(up ?x - tile ?y - tile)
		(down ?x - tile ?y - tile)
		(right ?x - tile ?y - tile)
		(left ?x - tile ?y - tile)
		
		(clear ?x - tile)
                (painted ?x - tile ?c - color)
		(robot-has ?r - robot ?c - color)
                (available-color ?c - color)
                (free-color ?r - robot))

(:functions (total-cost))

(:action change-color
  :parameters (?r - robot ?c - color ?c2 - color)
  :precondition (and (robot-has ?r ?c) (available-color ?c2))
  :effect (and (not (robot-has ?r ?c)) (robot-has ?r ?c2)
               (increase (total-cost) 5))
) 


(:action paint-up
  :parameters (?r - robot ?y - tile ?x - tile ?c - color)
  :precondition (and (robot-has ?r ?c) (robot-at ?r ?x) (up ?y ?x) (clear ?y))
  :effect (and (not (clear ?y)) (painted ?y ?c)
               (increase (total-cost) 2))
)


(:action paint-down
  :parameters (?r - robot ?y - tile ?x - tile ?c - color)
  :precondition (and (robot-has ?r ?c) (robot-at ?r ?x) (down ?y ?x) (clear ?y))
  :effect (and (not (clear ?y)) (painted ?y ?c)
(increase (total-cost) 2))
)


; Robot movements
(:action up 
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (up ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y))
               (increase (total-cost) 3))
)


(:action down 
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (down ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y))
               (increase (total-cost) 1))
)

(:action right 
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (right ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y))
	       (increase (total-cost) 1))
)

(:action left 
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (left ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y))
               (increase (total-cost) 1))
)

)

; problem
(define (problem name)
 (:domain floor-tile)
 (:objects tile_0-1 tile_0-2 tile_0-3 tile_0-4 tile_0-5 
           tile_1-1 tile_1-2 tile_1-3 tile_1-4 tile_1-5 
           tile_2-1 tile_2-2 tile_2-3 tile_2-4 tile_2-5 
           tile_3-1 tile_3-2 tile_3-3 tile_3-4 tile_3-5 
           tile_4-1 tile_4-2 tile_4-3 tile_4-4 tile_4-5 
           tile_5-1 tile_5-2 tile_5-3 tile_5-4 tile_5-5 - tile
           robot1 robot2 - robot
           white black - color
)
 (:init 
   (= (total-cost) 0)
   (robot-at robot1 tile_2-4)
   (robot-has robot1 white)
   (robot-at robot2 tile_2-3)
   (robot-has robot2 black)
   (available-color white)
   (available-color black)
   (clear tile_0-1)
   (clear tile_0-2)
   (clear tile_0-3)
   (clear tile_0-4)
   (clear tile_0-5)
   (clear tile_1-1)
   (clear tile_1-2)
   (clear tile_1-3)
   (clear tile_1-4)
   (clear tile_1-5)
   (clear tile_2-1)
   (clear tile_2-2)
   (clear tile_2-5)
   (clear tile_3-1)
   (clear tile_3-2)
   (clear tile_3-3)
   (clear tile_3-4)
   (clear tile_3-5)
   (clear tile_4-1)
   (clear tile_4-2)
   (clear tile_4-3)
   (clear tile_4-4)
   (clear tile_4-5)
   (clear tile_5-1)
   (clear tile_5-2)
   (clear tile_5-3)
   (clear tile_5-4)
   (clear tile_5-5)
   (up tile_1-1 tile_0-1)
   (up tile_1-2 tile_0-2)
   (up tile_1-3 tile_0-3)
   (up tile_1-4 tile_0-4)
   (up tile_1-5 tile_0-5)
   (up tile_2-1 tile_1-1)
   (up tile_2-2 tile_1-2)
   (up tile_2-3 tile_1-3)
   (up tile_2-4 tile_1-4)
   (up tile_2-5 tile_1-5)
   (up tile_3-1 tile_2-1)
   (up tile_3-2 tile_2-2)
   (up tile_3-3 tile_2-3)
   (up tile_3-4 tile_2-4)
   (up tile_3-5 tile_2-5)
   (up tile_4-1 tile_3-1)
   (up tile_4-2 tile_3-2)
   (up tile_4-3 tile_3-3)
   (up tile_4-4 tile_3-4)
   (up tile_4-5 tile_3-5)
   (up tile_5-1 tile_4-1)
   (up tile_5-2 tile_4-2)
   (up tile_5-3 tile_4-3)
   (up tile_5-4 tile_4-4)
   (up tile_5-5 tile_4-5)
   (down tile_0-1 tile_1-1)
   (down tile_0-2 tile_1-2)
   (down tile_0-3 tile_1-3)
   (down tile_0-4 tile_1-4)
   (down tile_0-5 tile_1-5)
   (down tile_1-1 tile_2-1)
   (down tile_1-2 tile_2-2)
   (down tile_1-3 tile_2-3)
   (down tile_1-4 tile_2-4)
   (down tile_1-5 tile_2-5)
   (down tile_2-1 tile_3-1)
   (down tile_2-2 tile_3-2)
   (down tile_2-3 tile_3-3)
   (down tile_2-4 tile_3-4)
   (down tile_2-5 tile_3-5)
   (down tile_3-1 tile_4-1)
   (down tile_3-2 tile_4-2)
   (down tile_3-3 tile_4-3)
   (down tile_3-4 tile_4-4)
   (down tile_3-5 tile_4-5)
   (down tile_4-1 tile_5-1)
   (down tile_4-2 tile_5-2)
   (down tile_4-3 tile_5-3)
   (down tile_4-4 tile_5-4)
   (down tile_4-5 tile_5-5)
   (right tile_0-2 tile_0-1)
   (right tile_0-3 tile_0-2)
   (right tile_0-4 tile_0-3)
   (right tile_0-5 tile_0-4)
   (right tile_1-2 tile_1-1)
   (right tile_1-3 tile_1-2)
   (right tile_1-4 tile_1-3)
   (right tile_1-5 tile_1-4)
   (right tile_2-2 tile_2-1)
   (right tile_2-3 tile_2-2)
   (right tile_2-4 tile_2-3)
   (right tile_2-5 tile_2-4)
   (right tile_3-2 tile_3-1)
   (right tile_3-3 tile_3-2)
   (right tile_3-4 tile_3-3)
   (right tile_3-5 tile_3-4)
   (right tile_4-2 tile_4-1)
   (right tile_4-3 tile_4-2)
   (right tile_4-4 tile_4-3)
   (right tile_4-5 tile_4-4)
   (right tile_5-2 tile_5-1)
   (right tile_5-3 tile_5-2)
   (right tile_5-4 tile_5-3)
   (right tile_5-5 tile_5-4)
   (left tile_0-1 tile_0-2)
   (left tile_0-2 tile_0-3)
   (left tile_0-3 tile_0-4)
   (left tile_0-4 tile_0-5)
   (left tile_1-1 tile_1-2)
   (left tile_1-2 tile_1-3)
   (left tile_1-3 tile_1-4)
   (left tile_1-4 tile_1-5)
   (left tile_2-1 tile_2-2)
   (left tile_2-2 tile_2-3)
   (left tile_2-3 tile_2-4)
   (left tile_2-4 tile_2-5)
   (left tile_3-1 tile_3-2)
   (left tile_3-2 tile_3-3)
   (left tile_3-3 tile_3-4)
   (left tile_3-4 tile_3-5)
   (left tile_4-1 tile_4-2)
   (left tile_4-2 tile_4-3)
   (left tile_4-3 tile_4-4)
   (left tile_4-4 tile_4-5)
   (left tile_5-1 tile_5-2)
   (left tile_5-2 tile_5-3)
   (left tile_5-3 tile_5-4)
   (left tile_5-4 tile_5-5)
)
 (:goal (and
    (painted tile_1-1 white)
    (painted tile_1-2 black)
    (painted tile_1-3 white)
    (painted tile_1-4 black)
    (painted tile_1-5 white)
    (painted tile_2-1 black)
    (painted tile_2-2 white)
    (painted tile_2-3 black)
    (painted tile_2-4 white)
    (painted tile_2-5 black)
    (painted tile_3-1 white)
    (painted tile_3-2 black)
    (painted tile_3-3 white)
    (painted tile_3-4 black)
    (painted tile_3-5 white)
    (painted tile_4-1 black)
    (painted tile_4-2 white)
    (painted tile_4-3 black)
    (painted tile_4-4 white)
    (painted tile_4-5 black)
    (painted tile_5-1 white)
    (painted tile_5-2 black)
    (painted tile_5-3 white)
    (painted tile_5-4 black)
    (painted tile_5-5 white)
))
 (:metric minimize (total-cost))
)

; plan
1. (up robot2 tile_2-3 tile_3-3)
   deleted: (robot-at robot2 tile_2-3) (clear tile_3-3)
   added: (robot-at robot2 tile_3-3) (clear tile_2-3)
   goals met: 0 of 25
2. (up robot1 tile_2-4 tile_3-4)
   deleted: (robot-at robot1 tile_2-4) (clear tile_3-4)
   added: (robot-at robot1 tile_3-4) (clear tile_2-4)
   goals met: 0 of 25
3. (up robot1 tile_3-4 tile_4-4)
   deleted: (robot-at robot1 tile_3-4) (clear tile_4-4)
   added: (robot-at robot1 tile_4-4) (clear tile_3-4)
   goals met: 0 of 25
4. (right robot1 tile_4-4 tile_4-5)
   deleted: (robot-at robot1 tile_4-4) (clear tile_4-5)
   added: (robot-at robot1 tile_4-5) (clear tile_4-4)
   goals met: 0 of 25
5. (paint-up robot1 tile_5-5 tile_4-5 white)
   deleted: (clear tile_5-5)
   added: (painted tile_5-5 white)
   goals met: 1 of 25
6. (left robot1 tile_4-5 tile_4-4)
   deleted: (robot-at robot1 tile_4-5) (clear tile_4-4)
   added: (robot-at robot1 tile_4-4) (clear tile_4-5)
   goals met: 1 of 25
7. (left robot1 tile_4-4 tile_4-3)
   deleted: (robot-at robot1 tile_4-4) (clear tile_4-3)
   added: (robot-at robot1 tile_4-3) (clear tile_4-4)
   goals met: 1 of 25
8. (paint-up robot1 tile_5-3 tile_4-3 white)
   deleted: (clear tile_5-3)
   added: (painted tile_5-3 white)
   goals met: 2 of 25
9. (left robot1 tile_4-3 tile_4-2)
   deleted: (robot-at robot1 tile_4-3) (clear tile_4-2)
   added: (robot-at robot1 tile_4-2) (clear tile_4-3)
   goals met: 2 of 25
10. (paint-up robot2 tile_4-3 tile_3-3 black)
   deleted: (clear tile_4-3)
   added: (painted tile_4-3 black)
   goals met: 3 of 25
11. (right robot2 tile_3-3 tile_3-4)
   deleted: (robot-at robot2 tile_3-3) (clear tile_3-4)
   added: (robot-at robot2 tile_3-4) (clear tile_3-3)
   goals met: 3 of 25
12. (right robot2 tile_3-4 tile_3-5)
   deleted: (robot-at robot2 tile_3-4) (clear tile_3-5)
   added: (robot-at robot2 tile_3-5) (clear tile_3-4)
   goals met: 3 of 25
13. (paint-up robot2 tile_4-5 tile_3-5 black)
   deleted: (clear tile_4-5)
   added: (painted tile_4-5 black)
   goals met: 4 of 25
14. (left robot2 tile_3-5 tile_3-4)
   deleted: (robot-at robot2 tile_3-5) (clear tile_3-4)
   added: (robot-at robot2 tile_3-4) (clear tile_3-5)
   goals met: 4 of 25
15. (up robot2 tile_3-4 tile_4-4)
   deleted: (robot-at robot2 tile_3-4) (clear tile_4-4)
   added: (robot-at robot2 tile_4-4) (clear tile_3-4)
   goals met: 4 of 25
16. (paint-up robot2 tile_5-4 tile_4-4 black)
   deleted: (clear tile_5-4)
   added: (painted tile_5-4 black)
   goals met: 5 of 25
17. (down robot2 tile_4-4 tile_3-4)
   deleted: (robot-at robot2 tile_4-4) (clear tile_3-4)
   added: (robot-at robot2 tile_3-4) (clear tile_4-4)
   goals met: 5 of 25
18. (change-color robot2 black white)
   deleted: (robot-has robot2 black)
   added: (robot-has robot2 white)
   goals met: 5 of 25
19. (paint-up robot2 tile_4-4 tile_3-4 white)
   deleted: (clear tile_4-4)
   added: (painted tile_4-4 white)
   goals met: 6 of 25
20. (down robot2 tile_3-4 tile_2-4)
   deleted: (robot-at robot2 tile_3-4) (clear tile_2-4)
   added: (robot-at robot2 tile_2-4) (clear tile_3-4)
   goals met: 6 of 25
21. (change-color robot2 white black)
   deleted: (robot-has robot2 white)
   added: (robot-has robot2 black)
   goals met: 6 of 25
22. (paint-up robot2 tile_3-4 tile_2-4 black)
   deleted: (clear tile_3-4)
   added: (painted tile_3-4 black)
   goals met: 7 of 25
23. (change-color robot1 white black)
   deleted: (robot-has robot1 white)
   added: (robot-has robot1 black)
   goals met: 7 of 25
24. (paint-up robot1 tile_5-2 tile_4-2 black)
   deleted: (clear tile_5-2)
   added: (painted tile_5-2 black)
   goals met: 8 of 25
25. (left robot1 tile_4-2 tile_4-1)
   deleted: (robot-at robot1 tile_4-2) (clear tile_4-1)
   added: (robot-at robot1 tile_4-1) (clear tile_4-2)
   goals met: 8 of 25
26. (change-color robot1 black white)
   deleted: (robot-has robot1 black)
   added: (robot-has robot1 white)
   goals met: 8 of 25
27. (paint-up robot1 tile_5-1 tile_4-1 white)
   deleted: (clear tile_5-1)
   added: (painted tile_5-1 white)
   goals met: 9 of 25
28. (down robot1 tile_4-1 tile_3-1)
   deleted: (robot-at robot1 tile_4-1) (clear tile_3-1)
   added: (robot-at robot1 tile_3-1) (clear tile_4-1)
   goals met: 9 of 25
29. (change-color robot1 white black)
   deleted: (robot-has robot1 white)
   added: (robot-has robot1 black)
   goals met: 9 of 25
30. (paint-up robot1 tile_4-1 tile_3-1 black)
   deleted: (clear tile_4-1)
   added: (painted tile_4-1 black)
   goals met: 10 of 25
31. (down robot1 tile_3-1 tile_2-1)
   deleted: (robot-at robot1 tile_3-1) (clear tile_2-1)
   added: (robot-at robot1 tile_2-1) (clear tile_3-1)
   goals met: 10 of 25
32. (change-color robot1 black white)
   deleted: (robot-has robot1 black)
   added: (robot-has robot1 white)
   goals met: 10 of 25
33. (paint-up robot1 tile_3-1 tile_2-1 white)
   deleted: (clear tile_3-1)
   added: (painted tile_3-1 white)
   goals met: 11 of 25
34. (down robot1 tile_2-1 tile_1-1)
   deleted: (robot-at robot1 tile_2-1) (clear tile_1-1)
   added: (robot-at robot1 tile_1-1) (clear tile_2-1)
   goals met: 11 of 25
35. (change-color robot1 white black)
   deleted: (robot-has robot1 white)
   added: (robot-has robot1 black)
   goals met: 11 of 25
36. (paint-up robot1 tile_2-1 tile_1-1 black)
   deleted: (clear tile_2-1)
   added: (painted tile_2-1 black)
   goals met: 12 of 25
37. (down robot1 tile_1-1 tile_0-1)
   deleted: (robot-at robot1 tile_1-1) (clear tile_0-1)
   added: (robot-at robot1 tile_0-1) (clear tile_1-1)
   goals met: 12 of 25
38. (change-color robot2 black white)
   deleted: (robot-has robot2 black)
   added: (robot-has robot2 white)
   goals met: 12 of 25
39. (change-color robot1 black white)
   deleted: (robot-has robot1 black)
   added: (robot-has robot1 white)
   goals met: 12 of 25
40. (left robot2 tile_2-4 tile_2-3)
   deleted: (robot-at robot2 tile_2-4) (clear tile_2-3)
   added: (robot-at robot2 tile_2-3) (clear tile_2-4)
   goals met: 12 of 25
41. (paint-up robot1 tile_1-1 tile_0-1 white)
   deleted: (clear tile_1-1)
   added: (painted tile_1-1 white)
   goals met: 13 of 25
42. (change-color robot1 white black)
   deleted: (robot-has robot1 white)
   added: (robot-has robot1 black)
   goals met: 13 of 25
43. (paint-up robot2 tile_3-3 tile_2-3 white)
   deleted: (clear tile_3-3)
   added: (painted tile_3-3 white)
   goals met: 14 of 25
44. (left robot2 tile_2-3 tile_2-2)
   deleted: (robot-at robot2 tile_2-3) (clear tile_2-2)
   added: (robot-at robot2 tile_2-2) (clear tile_2-3)
   goals met: 14 of 25
45. (right robot1 tile_0-1 tile_0-2)
   deleted: (robot-at robot1 tile_0-1) (clear tile_0-2)
   added: (robot-at robot1 tile_0-2) (clear tile_0-1)
   goals met: 14 of 25
46. (up robot2 tile_2-2 tile_3-2)
   deleted: (robot-at robot2 tile_2-2) (clear tile_3-2)
   added: (robot-at robot2 tile_3-2) (clear tile_2-2)
   goals met: 14 of 25
47. (paint-up robot2 tile_4-2 tile_3-2 white)
   deleted: (clear tile_4-2)
   added: (painted tile_4-2 white)
   goals met: 15 of 25
48. (change-color robot2 white black)
   deleted: (robot-has robot2 white)
   added: (robot-has robot2 black)
   goals met: 15 of 25
49. (down robot2 tile_3-2 tile_2-2)
   deleted: (robot-at robot2 tile_3-2) (clear tile_2-2)
   added: (robot-at robot2 tile_2-2) (clear tile_3-2)
   goals met: 15 of 25
50. (paint-up robot2 tile_3-2 tile_2-2 black)
   deleted: (clear tile_3-2)
   added: (painted tile_3-2 black)
   goals met: 16 of 25
51. (change-color robot2 black white)
   deleted: (robot-has robot2 black)
   added: (robot-has robot2 white)
   goals met: 16 of 25
52. (down robot2 tile_2-2 tile_1-2)
   deleted: (robot-at robot2 tile_2-2) (clear tile_1-2)
   added: (robot-at robot2 tile_1-2) (clear tile_2-2)
   goals met: 16 of 25
53. (paint-up robot2 tile_2-2 tile_1-2 white)
   deleted: (clear tile_2-2)
   added: (painted tile_2-2 white)
   goals met: 17 of 25
54. (change-color robot2 white black)
   deleted: (robot-has robot2 white)
   added: (robot-has robot2 black)
   goals met: 17 of 25
55. (right robot2 tile_1-2 tile_1-3)
   deleted: (robot-at robot2 tile_1-2) (clear tile_1-3)
   added: (robot-at robot2 tile_1-3) (clear tile_1-2)
   goals met: 17 of 25
56. (paint-up robot1 tile_1-2 tile_0-2 black)
   deleted: (clear tile_1-2)
   added: (painted tile_1-2 black)
   goals met: 18 of 25
57. (change-color robot1 black white)
   deleted: (robot-has robot1 black)
   added: (robot-has robot1 white)
   goals met: 18 of 25
58. (paint-up robot2 tile_2-3 tile_1-3 black)
   deleted: (clear tile_2-3)
   added: (painted tile_2-3 black)
   goals met: 19 of 25
59. (change-color robot2 black white)
   deleted: (robot-has robot2 black)
   added: (robot-has robot2 white)
   goals met: 19 of 25
60. (right robot1 tile_0-2 tile_0-3)
   deleted: (robot-at robot1 tile_0-2) (clear tile_0-3)
   added: (robot-at robot1 tile_0-3) (clear tile_0-2)
   goals met: 19 of 25
61. (right robot2 tile_1-3 tile_1-4)
   deleted: (robot-at robot2 tile_1-3) (clear tile_1-4)
   added: (robot-at robot2 tile_1-4) (clear tile_1-3)
   goals met: 19 of 25
62. (paint-up robot1 tile_1-3 tile_0-3 white)
   deleted: (clear tile_1-3)
   added: (painted tile_1-3 white)
   goals met: 20 of 25
63. (change-color robot1 white black)
   deleted: (robot-has robot1 white)
   added: (robot-has robot1 black)
   goals met: 20 of 25
64. (paint-up robot2 tile_2-4 tile_1-4 white)
   deleted: (clear tile_2-4)
   added: (painted tile_2-4 white)
   goals met: 21 of 25
65. (right robot1 tile_0-3 tile_0-4)
   deleted: (robot-at robot1 tile_0-3) (clear tile_0-4)
   added: (robot-at robot1 tile_0-4) (clear tile_0-3)
   goals met: 21 of 25
66. (right robot2 tile_1-4 tile_1-5)
   deleted: (robot-at robot2 tile_1-4) (clear tile_1-5)
   added: (robot-at robot2 tile_1-5) (clear tile_1-4)
   goals met: 21 of 25
67. (paint-up robot1 tile_1-4 tile_0-4 black)
   deleted: (clear tile_1-4)
   added: (painted tile_1-4 black)
   goals met: 22 of 25
68. (up robot2 tile_1-5 tile_2-5)
   deleted: (robot-at robot2 tile_1-5) (clear tile_2-5)
   added: (robot-at robot2 tile_2-5) (clear tile_1-5)
   goals met: 22 of 25
69. (paint-up robot2 tile_3-5 tile_2-5 white)
   deleted: (clear tile_3-5)
   added: (painted tile_3-5 white)
   goals met: 23 of 25
70. (change-color robot2 white black)
   deleted: (robot-has robot2 white)
   added: (robot-has robot2 black)
   goals met: 23 of 25
71. (down robot2 tile_2-5 tile_1-5)
   deleted: (robot-at robot2 tile_2-5) (clear tile_1-5)
   added: (robot-at robot2 tile_1-5) (clear tile_2-5)
   goals met: 23 of 25
72. (paint-up robot2 tile_2-5 tile_1-5 black)
   deleted: (clear tile_2-5)
   added: (painted tile_2-5 black)
   goals met: 24 of 25
73. (change-color robot2 black white)
   deleted: (robot-has robot2 black)
   added: (robot-has robot2 white)
   goals met: 24 of 25
74. (down robot2 tile_1-5 tile_0-5)
   deleted: (robot-at robot2 tile_1-5) (clear tile_0-5)
   added: (robot-at robot2 tile_0-5) (clear tile_1-5)
   goals met: 24 of 25
75. (paint-up robot2 tile_1-5 tile_0-5 white)
   deleted: (clear tile_1-5)
   added: (painted tile_1-5 white)
   goals met: 25 of 25
